#include <stdio.h>
//2.1.1
//void main() {
//	int a, b;
//	scanf_s("%d", &a);
//	scanf_s("%d", &b);
//	if (a > b) printf("%d",a); else printf("%d",b);
//}
//2.1.2
//void main() {
//	int v1, v2, v3;
//	SetConsoleCP(65001);
//	SetConsoleOutputCP(65001);
//	printf("Введите 3 числа: ");
//	scanf_s("%d%d%d", &v1, &v2, &v3);
//	if (v2 > v1) v1 = v2;
//	if (v3 > v1) v1 = v3;
//	printf("max = %d", v1);
//}
//2.1.3
//void main() {
//	int v;
//	SetConsoleCP(65001);
//	SetConsoleOutputCP(65001);
//	scanf_s("%d", &v);
//	if (v < 18) printf("Холодно");
//	if (v >= 18 && v<22) printf("прохладно");
//	if (v >= 22 && v < 26) printf("тепло");
//	if (v >= 26) printf("жарко");
//}
//2.1.4
//void main() {
//	SetConsoleCP(65001);
//	SetConsoleOutputCP(65001);
//	int a, b, c, d, e;
//	printf("Введите 5 чисел: \n");
//	scanf_s("%d", &a);
//	scanf_s("%d", &b);
//	scanf_s("%d", &c);
//	scanf_s("%d", &d);
//	scanf_s("%d", &e);
//	int max = a;
//	if (b > max) max = b;
//	if (c > max) max = c;
//	if (d > max) max = d;
//	if (e > max) max = e;
//	printf("%d - максимальное число", max);
//}
//2.1.5
//3. Температура на берегу Байкала зимой
// Нереальные значения: ниже -100°C или выше 20°C
//мороз: ниже −30°C  
//холодно: выше и −30°C, ниже −15°C
//тепло: выше и −15°C, ниже −5°C
//жарко: выше и −5°C
//Обоснование параметров: средние параметры температуры на берегу Байкала
// 
//void main() {
//	SetConsoleCP(65001);
//	SetConsoleOutputCP(65001);
//	printf("Введите температуру на берегу Байкала в градусах цельсия, допустимые значения от -90 до 20 градусов цельсия включительно\n");
//	float t;
//	scanf_s("%f", &t);
//	if (t > 20 || t < -100) {
//		printf("%.1f Недопустимое значение",t);
//	}
//	else {
//		if(t < -30)printf("Температура: %.1f - значит мороз",t);
//		else {
//			if (t >= -30 && t < -15) printf("Температура: %.1f - значит холодно", t);
//			else {
//				if (t >= -15 && t < -5) printf("Температура: %.1f - значит тепло", t);
//				else {
//					if (t>=-5) printf("Температура: %.1f - значит жарко", t);
//				}
//			}
//		}
//	}
//}
// 

//2.1.6
//Цена булочки в студенческом буфете
//Нереальные значения: ниже 35 или выше 750
//дёшево: от 35 до 85 включительно
//нормально: выше 85 и до 250 включительно
//дорого: выше 250 и до 550 включительно
//ужас дорого: выше 550 и до 1750 включительно
//Обоснование параметров: мои финансовые возможности, примерная ценовая политика в нашем городе, 35 рублей себестоимость стаканчика
//void main() {
//	SetConsoleCP(65001);
//	SetConsoleOutputCP(65001);
//	printf("Введите цену за булочку в буфете, допустимые значения от 35 до 1750 рублей\n");
//	float a;
//	scanf_s("%f", &a);
//	if (a > 1750 || a < 35) {
//		printf("%.1f Недопустимое значение",a);
//	}
//	else {
//		if(a<85)printf("Цена: %.1f - это дёшево для булочки в буфете или автомате",a);
//		else {
//			if (a >= 85 && a < 250) printf("Цена: %.1f - это нормально для булочки в буфете или автомате", a);
//			else {
//				if (a >= 250 && a < 550) printf("Цена: %.1f - это дорого для булочки в буфете или автомате", a);
//				else {
//					if (a>=550) printf("Цена: %.1f - это ужас дорого для булочки в буфете или автомате", a);
//				}
//			}
//		}
//	}
//}
//2.1.7
//Время потраченное на выполнение лабораторной задачи по основам алгоритмизации и программированию
//очень медленно - больше 6 часов
//медленно - от 6-4 часов
//нормально - от 4-2 часов
//быстро - от 2-0,5 часа
//мгновенно - от 0,5-0
//116 часов - максимально допустимое значение с учётом сроков получения/сдачи задания
//Отрицательным значение быть не может
//void main() {
//	SetConsoleCP(65001);
//	SetConsoleOutputCP(65001);
//	printf("Введите время потраченное на выполнение задания\n");
//	float a;
//	scanf_s("%f", &a);
//	if (a > 116 || a<0) {
//		printf("%.1f - Недопустимое значение. Указанное время превышает срок, выделенный на выполнение задачи. Отсчёт ведётся с момента выдачи задания до завершения приёма задач.", a);
//	}
//	else {
//		if (a <= 116 && a > 6) printf("%.1f - Задание выполнялось очень медленно", a);
//		else {
//			if(a<=6 && a>4) printf("%.1f - Задание выполнялось медленно", a);
//			else {
//				if (a<=4 && a>2) printf("%.1f - Задание выполнялось нормально", a);
//				else {
//					if (a <= 2 && a > 0.5) printf("%.1f - Задание выполнялось быстро", a);
//					else {
//						if (a <= 0.5 && a >= 0) printf("%.1f - Задание выполнялось мгновенно", a);
//					}
//				}
//			}
//		}
//	}
//}
//2.2.1
//void main() {
//	int n;
//	int i = 1;
//	printf("n = ");
//	scanf_s("%d", &n);
//	do {
//		printf("%d ", i);
//		i++;
//	} while (i <= n);
//}
//2.2.2
//#include <math.h>
//void main() {
//	SetConsoleCP(65001);
//	SetConsoleOutputCP(65001);
//	int i, stepen;
//	printf("Введите нужную степень для числа 2: ");
//	scanf_s("%d", &stepen);
//	i = 1;
//	int a;
//	do {
//		a = pow(2,i);
//		printf("2^%d=%d\n",i,a);
//		i++;
//	} while (i-1 < stepen);
//}
//2.2.3*
//void main() {
//	SetConsoleCP(65001);
//	SetConsoleOutputCP(65001);
//	int procent, summa, let;
//	printf("summa = ");
//	scanf_s("%d", &summa);
//	printf("procent = ");
//	scanf_s("%d", &procent);
//	printf("let = ");
//	scanf_s("%d", &let);
//
//	int i = 0;
//	do {
//		summa = summa + (summa * procent) / 100;
//		printf("%d RUB in %d year\n", summa, i);
//		i++;
//	} while (i < let);
//}
//2.2.4
//void main() {
//	SetConsoleCP(65001);
//	SetConsoleOutputCP(65001);
//	int n, i, a;
//	printf("N = ");
//	scanf_s("%d", &n);
//	i = 0;
//	a = 0;
//	do {
//		a++;
//		if (a % 2 == 0)
//		{
//			printf("%d ", a);
//			i++;
//		}
//	} while (i < n);
//}
//2.2.5
//void main() {
//	SetConsoleCP(65001);
//	SetConsoleOutputCP(65001);
//	int n, i, a, A;
//	printf("N = ");
//	scanf_s("%d", &n);
//	printf("A = ");
//	scanf_s("%d", &A);
//	i = 0;
//	a = 0;
//	do {
//		a++;
//		if (a % A == 0)
//		{
//			printf("%d ", a);
//			i++;
//		}
//	} while (i < n);
//}
//2.2.6 Вывести первые N символов из числа ПИ 
//void main() {
//   SetConsoleCP(65001);
//	SetConsoleOutputCP(65001);
//	int N, i;
//	char a; 
//	i = 0;
//    printf("Введите число N (доступно около 1000 знаков)\nN = ");
//	scanf_s("%d", &N);
//    char pi[] = "3.14159265358979323846264338327950288419716939937510582097494459230781640628620899862803482534211706798214808651328230664709384460955058223172535940812848111745028410270193852110555964462294895493038196442881097566593344612847564823378678316527120190914564856692346034861045432664821339360726024914127372458700660631558817488152092096282925409171536436330572703657595919530921861173819326117931051185480744623799627495673518857527248912279381830119491298336733624406566430860213949463952247371907021798609437027705392171762931767523846748184676694051320005681271452635608277857713427577896091736371787214684409012249534301465495853710507922796892589235420199561121290219608640344181598136297747713099605187072113499999983729780499510597317328160963185950244594553469083026425223082533446850352619311881710100031378387528865875332083814206171776691473035982534904287554687311595628638823537875937519577818577805321712268066130019278766111959092164201989380952572010654858632788659361533818279682303019520353018529689957736225994138912497217752834791315155748572424541506959508295331168617278558890750983817546374649393192550604009277016711390098488240128583616035637076601047101819429555961989467678374494482553797747268471040475346462080466842590694912";
//    do {
//        a = pi[i];
//        printf("%c", a);
//        i++;
//    } while (i < N);
//    printf("\n");
//}
//2.2.7 Студент первого курса работает стажёром в «СимбирСофт» и копит на Toyota Corolla 2022 года
void main() {
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	int c = 1600000;
	int zp = 55000;
	int n, i, a,b;
	a = 0;
	i = 0;
	printf("Введите число N месяцев откладывания, чтобы увидеть накопленную сумму и остаток для покупки студентом автомобиля Toyota Corolla 2022 года\nN = ");
	scanf_s("%d", &n);
	do {
		a += zp;
		b = c - a;
		i++;
		printf("%d - накопленная сумма за %d месяц(а/ев), осталось накопить: %d\n", a,i,b);
	} while (i < n);
}